# 5.2 Essential Functionality

In [1]:
import numpy as np
import pandas as pd

---

## Reindexing

reindex creates a new object with the data conformed to a new index

In [2]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [3]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
# rearraging the index and add new index label with nan value
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [5]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [6]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

With DataFrame, reindex can alter either the (row) index, columns, or both. When
passed only a sequence, it reindexes the rows in the result:

In [7]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])

In [8]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [10]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [11]:
frame.reindex(index=['a', 'b', 'c', 'd'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [12]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [13]:
frame.loc[['a', 'b', 'c', 'd'], states]

C:\Users\Agus Richard Lubis\Anaconda3\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

---

## Dropping Entires from an Axis

In [15]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [16]:
new_obj = obj.drop('c') # drop the intended row
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [17]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [18]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [19]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [20]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [21]:
obj.drop('c', inplace=True)

In [22]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

---

## Indexing, Selection, and Filtering

In [23]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [24]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [25]:
obj['b']

1.0

In [26]:
obj[1]

1.0

In [27]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [28]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [33]:
obj['b':'c'] # the last index (uing index label) is inclusive

b    1.0
c    2.0
dtype: float64

In [34]:
obj[1:2] # the last index(using index position) is exclusive

b    1.0
dtype: float64

In [35]:
obj['b':'c'] = 5

In [36]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [37]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [38]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [39]:
data['two'] # accessing column first

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [40]:
data[['one', 'four']]

          one  four
Ohio        0     3
Colorado    4     7
Utah        8    11
New York   12    15

In [41]:
data[:2] # accessing row first

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [42]:
data['three'] > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [49]:
data.loc[data['three'] > 5, 'two']

Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [50]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [51]:
data[data < 5] = 0

In [52]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Selection with loc and iloc

- labels -> loc
- integers -> iloc

In [56]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [53]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [54]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [55]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [57]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [58]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [59]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [61]:
data.at['Colorado', 'two']

5

---

## Integer Indexes

In [62]:
ser = pd.Series(np.arange(3.))

In [66]:
# ser[-1] -> error

In [67]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [69]:
ser2[-1] # no error, wonderful

2.0

---

## Arithmetic and Data Alignment

The result will be the union

In [70]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [71]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [72]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [74]:
s1 + s2 # missing values introduced

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [75]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [76]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [77]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [78]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [79]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [80]:
df1

   A
0  1
1  2

In [81]:
df2

   B
0  3
1  4

In [82]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

### Arithmetic methods with fill values

In [83]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [84]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [85]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [86]:
df2.loc[1, 'b'] = np.nan

In [87]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [88]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [90]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [91]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [92]:
df1.rdiv(1) # argument divided by df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [93]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [97]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Operations between DataFrame and Series

In [98]:
arr = np.arange(12.).reshape((3, 4))

In [99]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [100]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [101]:
series = frame.iloc[0]

In [102]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [103]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [104]:
frame - series # by default broadcating down the rows

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [108]:
frame - frame.loc['Utah']

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [109]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [110]:
series2

b    0
e    1
f    2
dtype: int64

In [111]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [112]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [113]:
series3 = frame['d']

In [114]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [116]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [118]:
frame.sub(series3, axis=0) # along columns or index

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

---

## Function Application and Mapping

In [119]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [120]:
frame

               b         d         e
Utah    0.010906 -0.206558 -0.453787
Ohio   -0.341004  0.451445  0.425913
Texas   0.169859  0.134854 -1.609499
Oregon -0.511612  0.702159  0.347346

In [121]:
np.abs(frame)

               b         d         e
Utah    0.010906  0.206558  0.453787
Ohio    0.341004  0.451445  0.425913
Texas   0.169859  0.134854  1.609499
Oregon  0.511612  0.702159  0.347346

In [122]:
f = lambda x: x.max() - x.min()

In [123]:
frame.apply(f)

b    0.681471
d    0.908718
e    2.035412
dtype: float64

In [124]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [125]:
frame.apply(f)

            b         d         e
min -0.511612 -0.206558 -1.609499
max  0.169859  0.702159  0.425913

In [126]:
form = lambda x: '%.2f' % x

In [127]:
frame.applymap(form)

            b      d      e
Utah     0.01  -0.21  -0.45
Ohio    -0.34   0.45   0.43
Texas    0.17   0.13  -1.61
Oregon  -0.51   0.70   0.35

In [128]:
frame.applymap(lambda x: '%.2f' % x)

            b      d      e
Utah     0.01  -0.21  -0.45
Ohio    -0.34   0.45   0.43
Texas    0.17   0.13  -1.61
Oregon  -0.51   0.70   0.35

In [132]:
frame['e'].apply(lambda x: '%.2f' % x)

Utah      -0.45
Ohio       0.43
Texas     -1.61
Oregon     0.35
Name: e, dtype: object

---

## Sorting and Ranking

In [133]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [134]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [135]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [136]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [139]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [138]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [140]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [141]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [142]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [143]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [144]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [145]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [146]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [147]:
frame.sort_values(by=['a', 'b']) # importance provided by arrangement of list

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Ranking assigns ranks from one through the number of valid data points in an array.

In [148]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [149]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [150]:
obj.rank() by default rank
# breaks ties by assigning each group the mean rank

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [151]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [152]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [153]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})

In [154]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [156]:
frame.rank(axis=0, method='min')

     b    a    c
0  3.0  1.0  2.0
1  4.0  3.0  3.0
2  1.0  1.0  4.0
3  2.0  3.0  1.0

In [160]:
frame['b'].astype(int)

0    4
1    7
2   -3
3    2
Name: b, dtype: int32

---

## Axis Indexes with Duplicate Labels

In [163]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [164]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [166]:
obj.index.is_unique

False

In [167]:
obj['a']

a    0
a    1
dtype: int64

In [168]:
obj['a'] = 2

In [169]:
obj

a    2
a    2
b    2
b    3
c    4
dtype: int64

In [170]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [171]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [172]:
df

          0         1         2
a -0.161941  2.032878 -1.502169
a  0.546934  0.833986  1.284058
b -0.281819 -0.472784  0.245048
b -2.012477 -0.867715 -0.157031

In [173]:
df.loc['b']

          0         1         2
b -0.281819 -0.472784  0.245048
b -2.012477 -0.867715 -0.157031